# _*_ coding=utf8 _*_
# 程序名：ITnization.py
# 作者：aJiea
# 用途: 自我反省

# 起源
from 珠海一群哈ZoomQuiet的小伙伴邀请 import 珠海正规但非正式开智线下聚会
from 珠海正规但非正式开智线下聚会 import 开智Python初级班课程
from 开智Python初级班课程 import 课程笔记标配Gitbook
from Gitbook import 《巨蟒小姐和圣极客》

# 定义一
def 能技():
	前期理解 = "不知道有能技这回事儿，感觉就是“技能”为了装逼，被倒过来说，有日系汉字范儿"
	后期理解 = "能引起目标人物注意的技能"
	
	# Step One 用目标人物和世界的交互方式去同他交互
	喜欢用颜文字的人，可能对Emoji，也讨厌不到哪儿去吧
	所以ZoomQuiet会觉得🐙🐶有趣呢

	# Step Two 你所了解的世界 = 世界对你的反馈 
	目标人物和世界的交互方式 = 他对世界的了解 = 世界对他的反馈
	用目标人物和世界的交互方式去同他交互 = 用他所了解的世界对他的反馈去和他交互 = 形成直接反馈，引起注意

	# Step Three 我所了解的世界 = 我的需求
	非技术人员在技术公司非技术部门上和技术人员打交道的班还是得学点技术知识
	进入编程的世界，串联【非技术部】和【技术部】，当一把🚪🔑，打开我的世界里处于关闭状态的门

# 定义二
def 梗():
	本意 = "滑稽有趣的点"
	衍生 = "像埋在地里的土豆"
		    首先要去发现，知道它的存在，锁定位置
		  	然后去挖掘，收获梗带来的知识果实
		  	有时因位置判断错误，挖了不一定有，继续挖下去就形成了坑  	

	# Step One 目标明确——挖土豆！
	给你一片地，你可以去挖土豆，可以去放牧，可以去盖房。
	地是不变的，变的是使用和支配方式。
	把开智课程看做是一块地，把学员看成这片地的支配者。各自挖掘知识点利益点。

	# Step Two 如何运用这块地？
	我的情况 = 非技术人员在技术公司非技术部门上和技术人员打交道的班还是得学点技术知识
	我的利益点 = 通过课程进一步达成AKA，提高和技术部门之间的沟通和解决问题效率
	如何用地 = 思维利益 > 技术利益

	# Step Three 问题和调整
	问题 = 每周作业达到不了交付度，跟不上进度，如何破
	ZoomQuiet提点 = 做不完就不要做了
	自省 = 对我放弃治疗了吗？不对。我的真正的KPI是什么？课程设置的通用进度 != 达到自我KPI的自拟进度
	调整 = 先要知道自己在这块地上有什么需求，才能根据需求去找到实现需求的技术
	所以，程序员思维 > 具体编程技术





